In [1]:
import pandas as pd

# air_dates.csv

### Fecha de lanzamiento de la serie

In [ ]:
air_dates_df = pd.read_csv("..\\datasets\\air_dates.csv")
air_dates_df

        is_first  show_id        date
0              1     1399  2011-04-17
1              1    71446  2017-05-02
2              1    66732  2016-07-15
3              1     1402  2010-10-31
4              1    63174  2016-01-25
...          ...      ...         ...
324281         0   240434         NaN
324282         0   240436         NaN
324283         0   240437  2022-05-08
324284         0   240438  2018-05-24
324285         0   240424  2007-05-12

[324286 rows x 3 columns]

In [5]:
air_dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 324286 entries, 0 to 324285
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   is_first  324286 non-null  int64
 1   show_id   324286 non-null  int64
 2   date      264930 non-null  object
dtypes: int64(2), object(1)
memory usage: 7.4+ MB

In [9]:
air_dates_df.isnull().sum()

is_first        0
show_id         0
date        59356
dtype: int64

# created_by_types.csv

### Nombre del creador de la serie

In [10]:
created_by_df = pd.read_csv("csv/created_by_types.csv")
created_by_df

       created_by_type_id     created_by_name
0                       1     Diane Kredensor
1                       2  Sylvain Gouverneur
2                       3         Tim Bullock
3                       4        Brad Garrett
4                       5       Ary Fernandes
...                   ...                 ...
31847               31848        Bruno Hampel
31848               31849             Zhou Mo
31849               31850         David Welch
31850               31851       Arvind Babbal
31851               31852      Damián Szifron

[31852 rows x 2 columns]

In [11]:
created_by_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31852 entries, 0 to 31851
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   created_by_type_id  31852 non-null  int64
 1   created_by_name     31852 non-null  object
dtypes: int64(1), object(1)
memory usage: 497.8+ KB

In [12]:
created_by_df.isnull().sum()

created_by_type_id    0
created_by_name       0
dtype: int64

# created_by.csv

### Asocia id de la serie con id de creador de la serie

In [13]:
created_by_df = pd.read_csv("csv/created_by.csv")
created_by_df

       show_id  created_by_type_id
0         1399               24015
1         1399                 627
2        71446                 481
3        66732               13781
4        66732                3222
...        ...                 ...
50511   240414               23777
50512   240422                6410
50513   240429               16183
50514   240429                7220
50515   240438               16213

[50516 rows x 2 columns]

In [14]:
created_by_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50516 entries, 0 to 50515
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   show_id             50516 non-null  int64
 1   created_by_type_id  50516 non-null  int64
dtypes: int64(2)
memory usage: 789.4 KB

In [15]:
created_by_df.isnull().sum()

show_id               0
created_by_type_id    0
dtype: int64

# genre_types.csv

### 20 géneros de series

In [ ]:
genre_types_df = pd.read_csv("csv/genre_types.csv")
genre_types_df

    genre_type_id          genre_name
0               1             Romance
1               2                Kids
2               3              Comedy
3               4               Crime
4               5             Musical
5               6      War & Politics
6               7    Sci-Fi & Fantasy
7               8                Soap
8               9             Western
9              10             History
10             11              Family
11             12               Drama
12             13                News
13             14               Music
14             15           Animation
15             16  Action & Adventure
16             17         Documentary
17             18             Reality
18             19             Mystery
19             20                Talk

In [19]:
genre_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   genre_type_id  20 non-null     int64
 1   genre_name     20 non-null     object
dtypes: int64(1), object(1)
memory usage: 452.0+ bytes

In [20]:
genre_types_df.isnull().sum()

genre_type_id    0
genre_name       0
dtype: int64

# genres.csv

### Asocia id de serie con id de género.

In [22]:
genres_df = pd.read_csv("csv/genres.csv")
genres_df

        show_id  genre_type_id
0          1399              7
1          1399             12
2          1399             16
3         71446              4
4         71446             12
...         ...            ...
143706   240431             18
143707   240432             18
143708   240433             18
143709   240438              6
143710   240438             17

[143711 rows x 2 columns]

In [23]:
genres_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 143711 entries, 0 to 143710
Data columns (total 2 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   show_id        143711 non-null  int64
 1   genre_type_id  143711 non-null  int64
dtypes: int64(2)
memory usage: 2.2 MB

In [24]:
genres_df.isnull().sum()

show_id          0
genre_type_id    0
dtype: int64

# language_types.csv

### 144 tipos de lenguajes

In [26]:
language_types_df = pd.read_csv("csv/language_types.csv")
language_types_df

     language_type_id language_name
0                   1            ko
1                   2            tn
2                   3            tt
3                   4            sk
4                   5            ru
..                ...           ...
138               139            fy
139               140            wa
140               141            sv
141               142            ro
142               143            el

[143 rows x 2 columns]

In [27]:
language_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 143 entries, 0 to 142
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   language_type_id  143 non-null    int64
 1   language_name     143 non-null    object
dtypes: int64(1), object(1)
memory usage: 2.4+ KB

In [29]:
language_types_df.isnull().sum()

language_type_id    0
language_name       0
dtype: int64

# languages.csv

### Asocia id de serie con id de lenguaje

In [31]:
languages_df = pd.read_csv("csv/languages.csv")
languages_df

        show_id  language_type_id
0          1399                66
1         71446               121
2         66732                66
3          1402                66
4         63174                66
...         ...               ...
113264   240432               121
113265   240433               121
113266   240436                66
113267   240437                80
113268   240438                66

[113269 rows x 2 columns]

In [32]:
languages_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113269 entries, 0 to 113268
Data columns (total 2 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   show_id           113269 non-null  int64
 1   language_type_id  113269 non-null  int64
dtypes: int64(2)
memory usage: 1.7 MB

In [33]:
languages_df.isnull().sum()

show_id             0
language_type_id    0
dtype: int64

# link_types.csv

### 3 tipos de links:

- homepage: página para ver la serie.
- backdrop_path: capturas de partes del show.
- poster_path: poster de la serie.

In [35]:
link_types_df = pd.read_csv("csv/link_types.csv")
link_types_df

   link_type_id      link_type
0             1       homepage
1             2  backdrop_path
2             3    poster_path

In [36]:
link_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   link_type_id  3 non-null      int64
 1   link_type     3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [37]:
link_types_df.isnull().sum()

link_type_id    0
link_type       0
dtype: int64

# links.csv

### Asocia id de link, tipo de link y el link

In [39]:
links_df = pd.read_csv("csv/links.csv")
links_df

,link_type_id,show_id,link
0,1,1399,http://www.hbo.com/game-of-thrones
1,1,71446,https://www.netflix.com/title/80192098
2,1,66732,https://www.netflix.com/title/80057281
3,1,1402,http://www.amc.com/shows/the-walking-dead--100...
4,1,63174,https://www.netflix.com/title/80057918
...,...,...,...
230071,3,240428,/p3PEOUFwJucQUcwYQ1KhHSwWGcx.jpg
230072,3,240430,/iBFaHfs4DRAl8mu5Ecgj1905wo5.jpg
230073,3,240434,/sjXnlXgBi0z5f4Yw4SfHB3TQUBz.jpg
230074,3,240436,/VnAfudAaWjxrY8nxpHkgwSTqQ8.jpg
230075,3,240438,/8PSPrI5DFvO1x2AFg2ybUwyTYoc.jpg

In [40]:
links_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230076 entries, 0 to 230075
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   link_type_id  230076 non-null  int64
 1   show_id       230076 non-null  int64
 2   link          230076 non-null  object
dtypes: int64(2), object(1)
memory usage: 5.3+ MB

In [41]:
links_df.isnull().sum()

link_type_id    0
show_id         0
link            0
dtype: int64

# network_types.csv

### Nombres de las networks (son muchas)

In [43]:
network_types_df = pd.read_csv("csv/network_types.csv")
network_types_df

      network_type_id                 network_name
0                   1                         SCTV
1                   2                     Facebook
2                   3                          NT1
3                   4                      SHO.com
4                   5                    Sparkk tv
...               ...                          ...
3393             3394                    RMC Sport
3394             3395                        BONGO
3395             3396                   sky Travel
3396             3397  Kumamoto Asahi Broadcasting
3397             3398                        BluTV

[3398 rows x 2 columns]

In [44]:
network_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3398 entries, 0 to 3397
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   network_type_id  3398 non-null   int64
 1   network_name     3398 non-null   object
dtypes: int64(1), object(1)
memory usage: 53.2+ KB

In [45]:
network_types_df.isnull().sum()

network_type_id    0
network_name       0
dtype: int64

# networks.csv

### Asocia id de serie con id de network

In [46]:
networks_csv = pd.read_csv("csv/networks.csv")
networks_csv

        show_id  network_type_id
0          1399             2321
1         71446             2847
2         71446             2111
3         66732             2847
4          1402             2678
...         ...              ...
108290   241299              796
108291   240431              738
108292   240432              738
108293   240433              738
108294   240437             2719

[108295 rows x 2 columns]

In [47]:
networks_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 108295 entries, 0 to 108294
Data columns (total 2 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   show_id          108295 non-null  int64
 1   network_type_id  108295 non-null  int64
dtypes: int64(2)
memory usage: 1.7 MB

In [48]:
networks_csv.isnull().sum()

show_id            0
network_type_id    0
dtype: int64

# origin_country_types.csv

### Código dos letras del país de origen de la serie (vendría bien poner el nombre completo)

In [49]:
origin_country_types_df = pd.read_csv("csv/origin_country_types.csv")
origin_country_types_df

     origin_country_type_id origin_country_name
0                         1                  PL
1                         2                  MP
2                         3                  UG
3                         4                  FJ
4                         5                  BS
..                      ...                 ...
155                     156                  ME
156                     157                  BZ
157                     158                  KW
158                     159                  CA
159                     160                  ID

[160 rows x 2 columns]

In [50]:
origin_country_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   origin_country_type_id  160 non-null    int64
 1   origin_country_name     160 non-null    object
dtypes: int64(1), object(1)
memory usage: 2.6+ KB

In [51]:
origin_country_types_df.isnull().sum()

origin_country_type_id    0
origin_country_name       0
dtype: int64

# production_company_types.csv

### Nombres de las compañías productoras

In [56]:
production_company_types_df = pd.read_csv("csv/production_company_types.csv")
production_company_types_df

       production_company_type_id production_company_name
0                               1     Malcolm Enterprises
1                               2             Felix Culpa
2                               3      Mig Beats Sdn. Bhd
3                               4                 Ebru TV
4                               5   Farmhouse Productions
...                           ...                     ...
21631                       21632   Ovation Entertainment
21632                       21633                     TV2
21633                       21634              Poolboy Oy
21634                       21635  Scholastic Productions
21635                       21636                  Redrum

[21636 rows x 2 columns]

In [57]:
production_company_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21636 entries, 0 to 21635
Data columns (total 2 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   production_company_type_id  21636 non-null  int64
 1   production_company_name     21636 non-null  object
dtypes: int64(1), object(1)
memory usage: 338.2+ KB

In [58]:
production_company_types_df.isnull().sum()

production_company_type_id    0
production_company_name       0
dtype: int64

# production_companies.csv

### Asocia id de serie con id de la compañía productora

In [53]:
production_companies_df = pd.read_csv("csv/production_companies.csv")
production_companies_df

       show_id  production_company_type_id
0         1399                        3212
1         1399                        1345
2         1399                        5460
3         1399                        6720
4        71446                        9691
...        ...                         ...
86791   240420                        9862
86792   240422                       17207
86793   240427                       13091
86794   240429                        1608
86795   240438                        9972

[86796 rows x 2 columns]

In [54]:
production_companies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86796 entries, 0 to 86795
Data columns (total 2 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   show_id                     86796 non-null  int64
 1   production_company_type_id  86796 non-null  int64
dtypes: int64(2)
memory usage: 1.3 MB

In [55]:
production_companies_df.isnull().sum()

show_id                       0
production_company_type_id    0
dtype: int64

# production_countries.csv

### Asocia id de serie, id de compañía productora e id de país de origen

In [59]:
production_countries_df = pd.read_csv("csv/production_countries.csv")
production_countries_df

       show_id  production_country_type_id  origin_country_type_id
0         1399                         165                      16
1         1399                          30                      16
2        71446                          10                     150
3        66732                          30                      16
4         1402                          30                      16
...        ...                         ...                     ...
81686   240419                          30                      16
81687   240422                         158                       1
81688   241299                          89                     136
81689   240429                          20                     103
81690   240438                         165                      26

[81691 rows x 3 columns]

In [60]:
production_countries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81691 entries, 0 to 81690
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   show_id                     81691 non-null  int64
 1   production_country_type_id  81691 non-null  int64
 2   origin_country_type_id      81691 non-null  int64
dtypes: int64(3)
memory usage: 1.9 MB

In [61]:
production_countries_df.isnull().sum()

show_id                       0
production_country_type_id    0
origin_country_type_id        0
dtype: int64

# production_country_types.csv

### Nombre de países

In [62]:
production_country_types_df = pd.read_csv("csv/production_country_types.csv")
production_country_types_df

     production_country_type_id production_country_name
0                             1                  Serbia
1                             2               Nicaragua
2                             3                   Qatar
3                             4                 Bolivia
4                             5            Burkina Faso
..                          ...                     ...
178                         179                 Lebanon
179                         180                Tanzania
180                         181             South Sudan
181                         182           French Guiana
182                         183              Mozambique

[183 rows x 2 columns]

In [63]:
production_country_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 183 entries, 0 to 182
Data columns (total 2 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   production_country_type_id  183 non-null    int64
 1   production_country_name     183 non-null    object
dtypes: int64(1), object(1)
memory usage: 3.0+ KB

In [64]:
production_country_types_df.isnull().sum()

production_country_type_id    0
production_country_name       0
dtype: int64

# show_votes.csv

### Votos y media de votos de la serie asociados al id de la serie

In [65]:
show_votes_df = pd.read_csv("csv/show_votes.csv")
show_votes_df

        vote_count  vote_average  show_id
0            21857         8.442     1399
1            17836         8.257    71446
2            16161         8.624    66732
3            15432         8.121     1402
4            13870         8.486    63174
...            ...           ...      ...
162138           0         0.000   240434
162139           0         0.000   240436
162140           0         0.000   240437
162141           0         0.000   240438
162142           0         0.000   240424

[162143 rows x 3 columns]

In [66]:
show_votes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162143 entries, 0 to 162142
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   vote_count    162143 non-null  int64
 1   vote_average  162143 non-null  float64
 2   show_id       162143 non-null  int64
dtypes: float64(1), int64(2)
memory usage: 3.7 MB

In [67]:
show_votes_df.isnull().sum()

vote_count      0
vote_average    0
show_id         0
dtype: int64

# shows.csv

### Nombres de las series y campos asociados

In [68]:
shows_df = pd.read_csv("csv/shows.csv")
shows_df

,show_id,name,number_of_seasons,number_of_episodes,overview,adult,in_production,original_name,popularity,tagline,eposide_run_time,type_id,status_id
0,1399,Game of Thrones,8,73,Seven noble families fight for control of the ...,0,0,Game of Thrones,1083.917,Winter Is Coming,0,1,1
1,71446,Money Heist,3,41,To carry out the biggest heist in history a m...,0,0,La Casa de Papel,96.354,The perfect robbery.,70,1,1
2,66732,Stranger Things,4,34,When a young boy vanishes a small town uncove...,0,1,Stranger Things,185.711,Every ending has a beginning.,0,1,2
3,1402,The Walking Dead,11,177,Sheriff's deputy Rick Grimes awakens from a co...,0,0,The Walking Dead,489.746,Fight the dead. Fear the living.,42,1,1
4,63174,Lucifer,6,93,Bored and unhappy as the Lord of Hell Lucifer...,0,0,Lucifer,416.668,It's good to be bad.,45,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
162138,240434,Reporting America at War,1,2,In television's first comprehensive look at an...,0,1,Reporting America at War,0.600,NaN,0,1,2
162139,240436,Wings Of The Red Star,1,13,A look at the history behind various Russian m...,0,1,Wings Of The Red Star,0.600,NaN,0,1,2
162140,240437,My Boss,1,2,Cheng Yao who dreamt of becoming a lawyer wa...,0,1,你也有今天,1.400,NaN,0,1,2
162141,240438,Spitfire Ace,1,4,Young pilots follow in the footsteps of the me...,0,0,Spitfire Ace,0.600,NaN,0,1,1
162142,240424,Eduardo cruz,1,1,Milfsmommature,0,1,Eduardo cruz,0.933,NaN,0,1,2

In [69]:
shows_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162143 entries, 0 to 162142
Data columns (total 13 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   show_id             162143 non-null  int64
 1   name                162138 non-null  object
 2   number_of_seasons   162143 non-null  int64
 3   number_of_episodes  162143 non-null  int64
 4   overview            90755 non-null   object
 5   adult               162143 non-null  int64
 6   in_production       162143 non-null  int64
 7   original_name       162138 non-null  object
 8   popularity          162143 non-null  float64
 9   tagline             5260 non-null    object
 10  eposide_run_time    162143 non-null  int64
 11  type_id             162143 non-null  int64
 12  status_id           162143 non-null  int64
dtypes: float64(1), int64(8), object(4)
memory usage: 16.1+ MB

In [70]:
shows_df.isnull().sum()

show_id                    0
name                       5
number_of_seasons          0
number_of_episodes         0
overview               71388
adult                      0
in_production              0
original_name              5
popularity                 0
tagline               156883
eposide_run_time           0
type_id                    0
status_id                  0
dtype: int64

# spoken_language_types.csv

### Tipos de lenguajes

In [71]:
spoken_language_types_df = pd.read_csv("csv/spoken_language_types.csv")
spoken_language_types_df

    spoken_language_type_id spoken_language_name
0                         1             Latviešu
1                         2                Latin
2                         3            Português
3                         4             Íslenska
4                         5              euskera
..                      ...                  ...
69                       70                 اردو
70                       71              ภาษาไทย
71                       72              한국어/조선말
72                       73              Español
73                       74                Hausa

[74 rows x 2 columns]

In [72]:
spoken_language_types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 2 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   spoken_language_type_id  74 non-null     int64
 1   spoken_language_name     74 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.3+ KB

In [73]:
spoken_language_types_df.isnull().sum()

spoken_language_type_id    0
spoken_language_name       0
dtype: int64

# spoken_languages.csv

### Asocia id de serie con id de lenguaje

In [75]:
spoken_languages_df = pd.read_csv("csv/spoken_languages.csv")
spoken_languages_df

        show_id  spoken_language_type_id
0          1399                        6
1         71446                       73
2         66732                        6
3          1402                        6
4         63174                        6
...         ...                      ...
111681   240432                       73
111682   240433                       73
111683   240436                        6
111684   240437                       50
111685   240438                        6

[111686 rows x 2 columns]

In [77]:
spoken_languages_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111686 entries, 0 to 111685
Data columns (total 2 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   show_id                  111686 non-null  int64
 1   spoken_language_type_id  111686 non-null  int64
dtypes: int64(2)
memory usage: 1.7 MB

In [78]:
spoken_languages_df.isnull().sum()

show_id                    0
spoken_language_type_id    0
dtype: int64

# status.csv

### Status de la serie (acabada, cancelada, etc). Asociado directamente en shows.csv

In [79]:
status_df = pd.read_csv("csv/status.csv")
status_df

   status_id       status_name
0          1             Ended
1          2  Returning Series
2          3          Canceled
3          4     In Production
4          5           Planned
5          6             Pilot

In [80]:
status_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   status_id    6 non-null      int64
 1   status_name  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [81]:
status_df.isnull().sum()

status_id      0
status_name    0
dtype: int64

# types.csv

### Tipo de serie (documental miniserie, reality). No tiene nada que ver con genero. Asociada directamente en shows.csv

In [83]:
types_df = pd.read_csv("csv/types.csv")
types_df

   type_id    type_name
0        1     Scripted
1        2  Documentary
2        3   Miniseries
3        4      Reality
4        5    Talk Show
5        6        Video
6        7         News

In [84]:
types_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   type_id    7 non-null      int64
 1   type_name  7 non-null      object
dtypes: int64(1), object(1)
memory usage: 244.0+ bytes

In [ ]:
types_df.isnull().sum()

type_id      0
type_name    0
dtype: int64